<template>
    <div style="padding-left: 10px;padding-right: 10px;text-align: left">
      <h3 style="">认识你之前我以为自己不可能谈恋爱了，没想到栽倒你手里了</h3>
      <hr/>
      <div style="font-size: 14px;white-space: pre-wrap;">
        你第一次加我的时候，我就看你的头像昵称大概知道你是什么样性格的女孩了，真的他妈和我之前想过的女孩想的一模一样，但是又不能快点接近你，只能猥琐一波说先睡了，其实心里还在想怎么追你怎么开始打扰你。🤔
        你说你有男朋友的时候我是真的难受，那晚没睡好。😭
        你每拒绝我一次我就难受一分，只能厚面皮。
        那晚电梯坏了我就知道我的机会来了，马上吹一波牛逼，不过抱你的时候你退半步的动作认真的嘛？😒
        我第一次吻你的时候我其实吃了点有味的东西，我不知道你感觉到了没，那之后的几天每次出门都刷牙，即使我五分钟前刚刷过，就是想给你留下好印象。但是现在好像不怎么注意了，嘿嘿。😏
        但是我担心是不是太快了，所以我总是问你爱我多长时间，我极不自信，并且自卑，而且小气，爱哭，爱演戏，我觉得自己很差劲。😳
        我之前觉得两个人互相喜欢是特别难的事情，如果真的有那就是运气真的太好了，我运气看来是到了。😘
        我知道自己的缺点，但是改不掉，我不是不想改，也在改，改不掉，江山易改本性难移，但是你只要不喜欢我就会改正，我会围着你转。😁
        我现在只担心自己会没有钱，我不想让你受苦了，穷真的很难受，我穷怕了。😱
        我答应你去的地方我会带你去的，你知道我强迫症说过的不实现我就很难受。😚
        我总觉得咱俩不会吵架，咱俩性格互补嘛，不知道你怎么想的，反正你很了解我。😜
        我不管明天怎么样，反正我现在很喜欢你，想娶你，明天大概也会，后天也会吧，大概忒持续好长好长时间，长到你烦了。🙄🙄🙄🙄🙄🙄🙄🙄🙄
      </div>
      <h1 v-if="isshow">你再皮？</h1>
      <br/>
      <img v-if="isshow" src="http://123.206.93.200/images/wife2.jpg">
      <br/><br/>
      <img @click="addto" src="http://123.206.93.200/images/wife1.jpg">
    </div>
</template>

<script>
    export default {
        data(){
          return {
            to:0,
            isshow:false
          }
        },methods:{
          addto(){
            this.to++
          }
      },watch:{
        'to'(){
          if(this.to>10){
            this.isshow = true;
          }
        }
      }
    }
</script>

<style scoped>
img{
  width: 100%;
  height: 100%;
}
</style>
